package zifc;

public class Abc {
	public static void main(String args[] ) {
	    StringBuffer s =new StringBuffer("汉皇重色思倾国御宇多年求不得杨家有女初长成养在深闺人未识天生丽质难自弃一朝选在君王侧回眸一笑百媚生六宫粉黛无颜色春寒赐浴华清池温泉水滑洗凝脂侍儿扶起娇无力始是新承恩泽时云鬓花颜金步摇芙蓉帐暖度春宵春宵苦短日高起从此君王不早朝承欢侍宴无闲暇春从春游夜专夜后宫佳丽三千人三千宠爱在一身金屋妆成娇侍夜玉楼宴罢醉和春姊妹弟兄皆列士可怜光采生门户遂令天下父母心不重生男重生女骊宫高处入青云仙乐风飘处处闻缓歌慢舞凝丝竹尽日君王看不足渔阳鼙鼓动地来惊破霓裳羽衣曲九重城阙烟尘生千乘万骑西南行翠华摇摇行复止西出都门百余里六军不发无奈何宛转蛾眉马前死花钿委地无人收翠翘金雀玉搔头君王掩面救不得回看血泪相和流黄埃散漫风萧索云栈萦纡登剑阁峨嵋山下少人行旌旗无光日色薄蜀江水碧蜀山青圣主朝朝暮暮情行宫见月伤心色夜雨闻铃肠断声天旋地转回龙驭到此踌躇不能去马嵬坡下泥土中不见玉颜空死处君臣相顾尽沾衣东望都门信马归归来池苑皆依旧太液芙蓉未央柳芙蓉如面柳如眉对此如何不泪垂春风桃李花开日秋雨梧桐叶落时西宫南内多秋草落叶满阶红不扫梨园弟子白发新椒房阿监青娥老夕殿萤飞思悄然孤灯挑尽未成眠迟迟钟鼓初长夜耿耿星河欲曙天鸳鸯瓦冷霜华重翡翠衾寒谁与共悠悠生死别经年魂魄不曾来入梦临邛道士鸿都客能以精诚致魂魄为感君王辗转思遂教方士殷勤觅排空驭气奔如电升天入地求之遍上穷碧落下黄泉两处茫茫皆不见忽闻海上有仙山山在虚无缥渺间楼阁玲珑五云起其中绰约多仙子中有一人字太真雪肤花貌参差是金阙西厢叩玉扃转教小玉报双成闻道汉家天子使九华帐里梦魂惊揽衣推枕起徘徊珠箔银屏迤逦开云鬓半偏新睡觉花冠不整下堂来风吹仙袂飘飖举犹似霓裳羽衣舞玉容寂寞泪阑干梨花一枝春带雨含情凝睇谢君王一别音容两渺茫昭阳殿里恩爱绝蓬莱宫中日月长回头下望人寰处不见长安见尘雾惟将旧物表深情钿合金钗寄将去钗留一股合一扇钗擘黄金合分钿但教心似金钿坚天上人间会相见临别殷勤重寄词词中有誓两心知七月七日长生殿夜半无人私语时在天愿作比翼鸟在地愿为连理枝天长地久有时尽此恨绵绵无绝期");
	          //把是变成字符串
	       s.append('。');
	        //给诗歌的结尾加上句号
	    for (int i = 7;i<s.length();i+=8) {
	        s.insert(i, "，");
	            }
	               //从第八个字为第一个添加逗号的地方，而后每隔7位，即在第八位添加逗号1
	       for (int a = 15;a<s.length();a+=15) {
	        s.deleteCharAt(a);
	            }
	        for (int b = 15;b<s.length()-1;b+=16) {
	             s.insert(b, "。");
	            }
	        //在诗歌的末句加一个句号，在每行第16个字符的地方添加句号 
	        for (int c = 16;c<s.length();c+=17) {
	            s.insert(c, "\n");
	            }
	        //为诗歌排版，在第17个字符的地方换行 
	        StringBuffer s1 = new StringBuffer("重");
	       //查寻字的出现次数
	       System.out.println(s);
	       System.out.println("出现次数为："+count(s.toString(),s1.toString()));
	   }
	  static int count(String n1,String n2) {
	    int sum = 0;
	    int index = -1;
	    while((index = n1.indexOf(n2,index))>-1) {
	     index += 1;
	     sum++;
	     //操作中可能出现异常，异常处理
	    }
	    return sum;
	  }
}
